#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
yandex_vpc_network.default: Refreshing state... [id=enp9og9514r6d9ru2f9t]
yandex_container_registry.my-reg: Refreshing state... [id=crpul4f5308ai5814ctv]
yandex_vpc_subnet.public-d: Refreshing state... [id=fl8s4l85l106qico3nge]
yandex_vpc_security_group.k8s-public-services: Refreshing state... [id=enprulj5iq6c6c21st96]
yandex_vpc_subnet.public-b: Refreshing state... [id=e2lis1sv742dsf54orac]
yandex_vpc_subnet.public-a: Refreshing state... [id=e9b1ng2iccbclh4iatpd]
yandex_vpc_security_group.k8s-nodes-ssh-access: Refreshing state... [id=enp8odqnkm7iuslgg9sj]
yandex_vpc_security_group.k8s-master-whitelist: Refreshing state... [id=enp3nqdfna10hfnv0jn2]
yandex_vpc_security_group.k8s-main-sg: Refreshing state... [id=enpe0fqgu4oh6e44o5kc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # yandex_kubernetes_cluster.k8s-cluster will be created
  + resource "yandex_kubernetes_cluster" "k8s-cluster" {
      + cluster_ipv4_range       = (known after apply)
      + cluster_ipv6_range       = (known after apply)
      + created_at               = (known after apply)
      + description              = (known after apply)
      + folder_id                = (known after apply)
      + health                   = (known after apply)
      + id                       = (known after apply)
      + labels                   = (known after apply)
      + log_group_id             = (known after apply)
      + name                     = "k8s-cluster"
      + network_id               = "enp9og9514r6d9ru2f9t"
      + node_ipv4_cidr_mask_size = 24
      + node_service_account_id  = "ajelcp7uj1iq2c3cseq0"
      + release_channel          = (known after apply)
      + service_account_id       = "ajelcp7uj1iq2c3cseq0"
      + service_ipv4_range       = (known after apply)
      + service_ipv6_range       = (known after apply)
      + status                   = (known after apply)

      + master {
          + cluster_ca_certificate = (known after apply)
          + etcd_cluster_size      = (known after apply)
          + external_v4_address    = (known after apply)
          + external_v4_endpoint   = (known after apply)
          + external_v6_endpoint   = (known after apply)
          + internal_v4_address    = (known after apply)
          + internal_v4_endpoint   = (known after apply)
          + public_ip              = true
          + security_group_ids     = [
              + "enp3nqdfna10hfnv0jn2",
              + "enpe0fqgu4oh6e44o5kc",
            ]
          + version                = "1.27"
          + version_info           = (known after apply)

          + master_logging {
              + audit_enabled              = true
              + cluster_autoscaler_enabled = true
              + enabled                    = true
              + events_enabled             = true
              + folder_id                  = "b1gpr28nt91k1jnaj91s"
              + kube_apiserver_enabled     = true
            }

          + regional {
              + region = "ru-central1"

              + location {
                  + subnet_id = "e9b1ng2iccbclh4iatpd"
                  + zone      = "ru-central1-a"
                }
              + location {
                  + subnet_id = "e2lis1sv742dsf54orac"
                  + zone      = "ru-central1-b"
                }
              + location {
                  + subnet_id = "fl8s4l85l106qico3nge"
                  + zone      = "ru-central1-d"
                }
            }
        }
    }

  # yandex_kubernetes_node_group.worker-nodes-a will be created
  + resource "yandex_kubernetes_node_group" "worker-nodes-a" {
      + cluster_id        = (known after apply)
      + created_at        = (known after apply)
      + description       = (known after apply)
      + id                = (known after apply)
      + instance_group_id = (known after apply)
      + labels            = (known after apply)
      + name              = "worker-nodes-a"
      + status            = (known after apply)
      + version           = "1.26"
      + version_info      = (known after apply)

      + allocation_policy {
          + location {
              + subnet_id = (known after apply)
              + zone      = "ru-central1-a"
            }
        }

      + instance_template {
          + metadata                  = (known after apply)
          + nat                       = (known after apply)
          + network_acceleration_type = (known after apply)
          + platform_id               = "standard-v2"

          + boot_disk {
              + size = 64
              + type = "network-hdd"
            }

          + container_runtime {
              + type = "containerd"
            }

          + network_interface {
              + ipv4               = true
              + ipv6               = (known after apply)
              + nat                = true
              + security_group_ids = [
                  + "enp8odqnkm7iuslgg9sj",
                  + "enpe0fqgu4oh6e44o5kc",
                  + "enprulj5iq6c6c21st96",
                ]
              + subnet_ids         = [
                  + "e9b1ng2iccbclh4iatpd",
                ]
            }

          + resources {
              + core_fraction = (known after apply)
              + cores         = 2
              + gpus          = 0
              + memory        = 4
            }
        }

      + scale_policy {
          + fixed_scale {
              + size = 1
            }
        }
    }

  # yandex_kubernetes_node_group.worker-nodes-b will be created
  + resource "yandex_kubernetes_node_group" "worker-nodes-b" {
      + cluster_id        = (known after apply)
      + created_at        = (known after apply)
      + description       = (known after apply)
      + id                = (known after apply)
      + instance_group_id = (known after apply)
      + labels            = (known after apply)
      + name              = "worker-nodes-b"
      + status            = (known after apply)
      + version           = "1.26"
      + version_info      = (known after apply)

      + allocation_policy {
          + location {
              + subnet_id = (known after apply)
              + zone      = "ru-central1-b"
            }
        }

      + instance_template {
          + metadata                  = (known after apply)
          + nat                       = (known after apply)
          + network_acceleration_type = (known after apply)
          + platform_id               = "standard-v2"

          + boot_disk {
              + size = 64
              + type = "network-hdd"
            }

          + container_runtime {
              + type = "containerd"
            }

          + network_interface {
              + ipv4               = true
              + ipv6               = (known after apply)
              + nat                = true
              + security_group_ids = [
                  + "enp8odqnkm7iuslgg9sj",
                  + "enpe0fqgu4oh6e44o5kc",
                  + "enprulj5iq6c6c21st96",
                ]
              + subnet_ids         = [
                  + "e2lis1sv742dsf54orac",
                ]
            }

          + resources {
              + core_fraction = (known after apply)
              + cores         = 2
              + gpus          = 0
              + memory        = 4
            }
        }

      + scale_policy {
          + fixed_scale {
              + size = 1
            }
        }
    }

  # yandex_kubernetes_node_group.worker-nodes-d will be created
  + resource "yandex_kubernetes_node_group" "worker-nodes-d" {
      + cluster_id        = (known after apply)
      + created_at        = (known after apply)
      + description       = (known after apply)
      + id                = (known after apply)
      + instance_group_id = (known after apply)
      + labels            = (known after apply)
      + name              = "worker-nodes-d"
      + status            = (known after apply)
      + version           = "1.26"
      + version_info      = (known after apply)

      + allocation_policy {
          + location {
              + subnet_id = (known after apply)
              + zone      = "ru-central1-d"
            }
        }

      + instance_template {
          + metadata                  = (known after apply)
          + nat                       = (known after apply)
          + network_acceleration_type = (known after apply)
          + platform_id               = "standard-v2"

          + boot_disk {
              + size = 64
              + type = "network-hdd"
            }

          + container_runtime {
              + type = "containerd"
            }

          + network_interface {
              + ipv4               = true
              + ipv6               = (known after apply)
              + nat                = true
              + security_group_ids = [
                  + "enp8odqnkm7iuslgg9sj",
                  + "enpe0fqgu4oh6e44o5kc",
                  + "enprulj5iq6c6c21st96",
                ]
              + subnet_ids         = [
                  + "fl8s4l85l106qico3nge",
                ]
            }

          + resources {
              + core_fraction = (known after apply)
              + cores         = 2
              + gpus          = 0
              + memory        = 4
            }
        }

      + scale_policy {
          + fixed_scale {
              + size = 1
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

Results for commit: 9f34327d03f5aae641405eaec5402f89ebd82b9d

*Pusher: @estomper, Action: `pull_request`, Working Directory: `11-diplom/terraform/main/`, Workflow: `Terraform deploy K8S CI/CD`*